#โปรแกรมหาค่าเฉลี่ยของข้อมูล จำนวน 10 ค่า โดยมีการวนซ้ำรับค่าข้อมูล 10 ครั้ง แล้วแสดงผลลัพธ์หาค่าเฉลี่ยของข้อมูลทั้ง 10 ค่า
n = 10
total = 0.0
#input รับค่าตัวเลขเข้ามาทางแป้นพิมพ์ 10 ครั้ง ด้วยคำสั่ง for
for i in range(n):
    #process เมื่อได้ตัวเลขมาครบทั้ง 10 จำนวนแล้ว นำมาบวกกันแล้วหารด้วยจำนวนตัวทั้งหมดคือ 10
    #Define of variable กำหนดให้ตัวเลชที่รับเข้ามาเป็น float เลขทศนิยม
    number = float(input("ENTER NUMBER:"))
    total = total + number
avg = total/n
#output เมื่อทำขั้นตอน process แล้วได้คำตอบให้แสดง output ออกทางหน้าจอด้วยคำสั่ง print 
print("AVERAGE =", avg)
        






