#!/usr/bin/env python
# coding: utf-8

# In[3]:


#โจทย์ โดยเฉลี่ยแล้วน้ำหนักสมองของคนเป็น 0.019 เท่าของตัว จงหาว่าสมองของนักศึกษาหนักประมาณเท่าไหร่

BrainWeight=0.019
BODY_WEIGHT=float(input("BODY_WEIGHT:"))
WEIGHT=BODY_WEIGHT*BrainWeight
print("TOTAL=",WEIGHT,"Kg.")


# In[5]:


#โจทย์ให้แปลงจำนวนที่ดินจากไร่ให้เป็นตารางเมตร โดยกำหนดให้ 1 ไร่ = 1600 ตารางเมตร 

LAND =int(input("NUMBER OF LAND: "))
LAND1=LAND*1600
print("LAND PLOTS:" , LAND1)


# In[11]:


#โจทย์ if else 
#ร้านขายเสื้อยี่ห้อหนึ่ง ขายเสื้อตัวละ 475 บาท ถ้าซื้อ 1 ตัวลดราคา 10% ถ้าเรามีเงิน 450 เราสามารถซื้อได้หรือไม่

SALE=0.1 # มาจาก 10/100 คือจำนวนที่ลดราคา
MONEY=int(input("MONEY="))
sale=MONEY*0.1
DISCOUNT=MONEY-sale
if DISCOUNT >= 450:
    print("TOTAL SALE=", DISCOUNT, "BAHT")
else:
    print("NOT ENOUGH MONEY")


# In[62]:


#โจทย์ if elif else 
#ร้านของเสื้อยี่ห้อหนึ่ง ขายเสื้อตัวละ 650 บาท แต่ตอนนี้อยู่ในช่วงโปรโมชั่นลดราคา 20% ถ้าเรามีเงิน 1ุ600 บาทเราสามารถซื้อได้กี่ตัว

SALE=0.2 # มาจาก 20/100 คือจำนวนที่ลดราคา
MONEY=int(input("MONEY="))
sale=MONEY*0.2
DISCOUNT=MONEY-sale
if DISCOUNT <= 600:
    print("คุณสามารถซื้อได้ 1 ตัว")
elif DISCOUNT <= 1200:
    print("คุณสามารถซื้อได้ 2 ตัว")
elif DISCOUNT <= 1600:
    print("คุณสามารถซื้อได้ 3 ตัว")

else:
    print("จำนวนเงินคุณไม่พอ")


# In[71]:


#โจทย์ รับตัวเลขจำนวนเต็มเข้ามาโดยไมม่จำนวนครั้งจนกว่าเราจะป้อนจำวนวที่น้อยกว่า 0 ถึงจะหยุดการทำงานแล้วแสดงจำนวนที่มีค่ามากที่สุดที่เราป้อยเข้ามา
max=0
num=int(input("ENTER NUMBER :"))
while num>0:
    if num>max:
        max=num
    num=int(input("ENTER NUMBER :"))
print("MAX NUMBER", max)
    


# In[73]:


#โจทย์ ถ้าคนงาน 6 คน ทำความสะอาดห้องเรียนภายในเวลา 24 ชั่วโมง แล้วถ้ามีคนงานแค่ 2 คน จะต้องใช้ระยะเวลาเท่าใดในการทำความสะอาดห้อง

Person=int(input("คนงานที่กำหนด")) # 6 คน
Hour=int(input("เวลาที่กำหนด:")) # 24 ชั่โมง
Worker=int(input("จำนวนคนงานที่ทำ:")) #จำนวนที่เราต้องการหา
Total=(Person*Hour)/Worker
print("จำนวนเลาที่ทำความาสะอาด =", Total ,"ชั่วโมง")


# In[76]:


#โจทย์ ซื้อส้ม 5 กิโลกรัม เป็นเงิน 250 บาท ถ้าซื้อส้ม 15 กิโลกรัม จะต้องจ่ายเงินเท่าไหร่

Amount=int(input("จำนวนส้มที่กำหนดราคา:"))
Price=int(input("จำนวนเงินที่กำหนด:"))
AM=int(input("จำนวนที่เราต้องการซื้อ:"))
total=Price/Amount
total1=AM*total
print("เราต้องจ่ายเงินทั้งหมด=", total1, "บาท")


# In[77]:


#โจทย์ สมมุติว่าเดือนหน้า เราจะเดินทางไปนิวซีแลน มีเงินไทยอยู่ 50000 บาท จะแลกเป็นเงินสกุลของนิวซีแลนได้เท่าไหร่
#กำหนดให้ สกุลเงินนิวซีแลนคืิ NZD มีค่าเท่ากับ  1 NZD = 19.6770 บาท

NZD=19.6770 
Money=int(input(" MONEY :"))
ThaiMoney=Money/NZD
print("แลกได้=",ThaiMoney, "NZD")


# In[80]:


#โจทย์  รับค่าจำนวนเงินสกุลริงกิต ประเทศมาเลเซียเข้า จากนำมาแปลงให้เป็นจำนวนเงินสกุลบาท เงินไทย
#กำหนดให้ 1 ริงกิต = 7.85 บาท

MA=7.85 
Money=int(input(" MONEY :"))
ThaiMoney= Money*MA
print("แลกได้=",ThaiMoney, "บาท")


# In[81]:


#โจทย์ for
# โจทย์ให้นักศึกษากำหนดค่าตัวเลขมา 1 จำนวน ตั้งแต่ 10-30 เป็นตัวแปร A จากนั้นให้เลือกตัวเลขตั้งแต่ 2-12 มา 1 จำนวน 
#เป็นตัวแปร B แล้วให้หาว่า ตัวแปร B สามารถหารจำนวนในช่วงที่ 15-A ใดแล้วมีเศษเป็น 0 บ้าง จงแสดงจำนวนทั้งหมดนั้น  

A = int(input("Enter A in range 10-30 :   "))
B = int(input("Enter B in range 2-12 :   ")) 
for C in range(10,A+1): 
    if C%B == 0:         
        print(C,end='   ')


# In[ ]:




