#โปรแกรมรับค่าแม่สูตร ผ่านคีย์บอร์ด หากรับเลข 2 ก็ให้แสดงสูตรคูณแม่ 2 บนจอภาพ โดยใช้คำสั่ง for
#input รับค่าตัวเลขเข้ามาทางแป้นพิมพ์
#Define of variabie กำหนดให้ตัวเลขที่รับเข้ามาทางแป้นพิมพ์เป็น int หรือจำนวนเต็ม
number = int(input("ENTER NUMBER :"))
#process คำเงื่อนไข for โดยจะแสดงแม่สูตรคูณถึง x 12 ของตัวเลขที่รับเข้ามาทางแป้นพิมพ์
for i in range(1,13):
    #output เมื่อทำขั้นตอน process แล้วได้คำตอบ output ให้แสดงผลออกทางหน้าจอด้วยคำสั่ง print
    print(number,"x",i,"=",number*i)
    







