#!/usr/bin/env python
# coding: utf-8

# In[6]:


print("CP ALL, 7-Eleven ราชมงคลสุวรรณภูมิ (สา ""(06582)")
print("TAX#0107542000011 ""(VAT Included)")
print("VAT Code 049658 POS#092C2CWP09200239")
print(" ใบเสร็จรับเงิน/ใบกำกับภาษีอย่าง")
print(4, "เลย์คลาสสิครสมันฝรั่ง", 10.00, "THB", (4*10.00), "THB")
print(1, "ขนมปังพิซซ่าฮาวาย", 15.00, "THB", (1*15.00), "THB")
print(1, "แครกเกอร์เนลี่ รสสาหร่าย", 13.00, "THB", (1*13.00), "THB")
print(1, "แครกเกอร์เนลี่ รสคลาสสิค", 13.00, "THB", (1*13.00), "THB")
print("ยอดสุทธิ 7 ชิ้น", (40+15+13+13))
print("เงินสด/เงินทอน", (100-81))
print("R#0000007311   P3:0658201   03/07/62    15:46")
print("**ศนูย์ลูกค้าประชาสัมพันธ์ 0-2826-7777 **")


# In[ ]:




