# โปรแกรมวนซ้ำเพื่อรับค่าจำนวน 10 จำนวน แล้วแสดงผลลัพธ์ของผลรวมของตัวเลขทั้ง 10 จำนวนออกหน้าจอ
n = 10
total = 0.0
#Define of variable กำหนดค่า n เท่ากับ 0 กำหนดค่า total เท่ากับ 0 จำนวนที่รับเข้ามาให้เป็น float หรือทศนิยม
for i in range(n):
    #input รับค่าจำนวนเข้ามาทางหน้าจอ
    #process เข้าเงื่อนไข for เพื่อรับจำนวน 10 จำนวนทางแป้นพิมพ์แล้วนำจำนวนทั้งหมดมาบวกกัน
    number = float(input("ENTER NUMBER :"))
    total = total+number
#output เมื่อทำขั้นตอน process เเล้วได้คำตอบ output แล้วให้แสดงผลออกทางหน้าจอด้วยคำสั่ง print
print("TOTAL:",total)
    


# In[ ]:





# In[ ]:




