#โปรแกรมเปรียบเทียบตัวเลขจำนวนเต็มที่รับเข้ามาทางคีย์บอร์ด จำนวน 3 ตัว แล้วแสดงผลว่า ตัวเลขตัวใดมีค่าน้อยที่สุด และถ้าตัวเลขมีค่าเท่ากัน ให้แสดงว่า "พบตัวเลขมีค่าเท่ากัน" ให้จบโปรแกรม
#input รับค่าตัวเลขสามจำนวนเข้ามาทางแป้นพิมพ์
#Define of variable กำหนดค่าให้ตัวแปลทั้งหมดเป็น int หรือจำนวนเต็ม
n1,n2,n3 = (int(e) for e in input("NUMBER :").split())
#process นำตัวเลขสามจำนวนมาเข้าคำสั่ง if เพื่อหาจำนวนที่น้อยที่สุดหรือเท่ากัน
if n1<n2 and n1<n3:
    print(n1)
elif n2<n1 and n2<n3:
    print(n2)
elif n3<n1 and n3<n2:
    print(n3)
else:
    print("EQUAL AMOUNT")
#output เมื่อทำขั้น process แล้วได้ค่า output ออกมาให้แสดงออกทางหน้าจอด้วยคำสั่ง print





