#โปรแกรมคำนวณอายุโดยให้ผู้ใช้งานป้อนปี พ.ศ ผ่านทางคีย์บอร์ด โดยบังคับว่าต้องมีการเรียกใช้ฟังก์ชั่นแปลงข้อมูลก่อนนำไปคำนวณ แล้วแสดงผลว่าปัจจุบันอายุเท่าไร
#input รับค่าปี พ.ศ. เข้ามาทางแป้นพิมพ์โดยครั้งแรกรับค่าปี พ.ศ. ในปัจจุบัน และครั้งที่สองรับค่าปีที่เกิด
#Define of variable กำหนดให้ค่าที่รับเข้ามาทางแป้นพิมพ์เป็นจำนวนเต็ม int
PresentYear = int(input("Enter present year :"))
YearOfBrith = int(input("Enter year of birth :"))
#process โดยนำปีปัจจุบันมาลบกับปีที่เกิดเพื่อหาคำตอบ
age = PresentYear-YearOfBrith
#output คำได้คำตอบจากขั้ย process แล้วก็ output คำตอบออกทางหน้าจอด้วยคำสั่ง print
print("age =" , age)


# In[ ]:




